#  В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.


import random
n = int(input('Введите число грядок ')) 
def Result(n):
    my_List=[round(random.uniform(1,12),1) for _ in range(n)]
    sum_List =[]

    print(my_List)

    sum_List = [round(sum(my_List[i:i+3]),1) for i in range(len(my_List))]

    return max(sum_List)


print(f'Максимум за один проход можно собрать {Result(n)} килограмм')
